
#-*-coding:utf-8 -*-

bils = 100
ls = 150
wv = 50
cv = 200
label_mode = 'BIOES'
len_sentence = 400


if label_mode == 'BIO':
    l2i_dic = {'B': 1, 'I': 2, 'O': 0}
    i2l_dic = {0: 'O', 1: 'B', 2: 'I'}

else:
     l2i_dic = {u'B-解剖部位': 1, u'B-影像检查': 2, u'B-疾病和诊断':3,u'B-药物':4,u'B-手术':5,u'B-实验室检验':6,u'I-解剖部位':7,
                u'I-影像检查':8,u'I-疾病和诊断':9,u'I-药物':10,u'I-手术':11,u'I-实验室检验':12,u'E-解剖部位': 13, u'E-影像检查': 14, u'E-疾病和诊断':15,
                u'E-药物':16,u'E-手术':17,u'E-实验室检验':18,u'S-解剖部位': 19, u'S-影像检查': 20,u'S-疾病和诊断':21,u'S-药物':22,u'S-手术':23,u'S-实验室检验':24,"O":0}
     i2l_dic = {0:"O",1:u'B-解剖部位', 2:u'B-影像检查', 3:u'B-疾病和诊断',4:u'B-药物',5:u'B-手术',6:u'B-实验室检验',7:u'I-解剖部位',
               8:u'I-影像检查',9:u'I-疾病和诊断',10:u'I-药物',11:u'I-手术',12:u'I-实验室检验',13:u'E-解剖部位', 14:u'E-影像检查',15: u'E-疾病和诊断',
                16:u'E-药物',17:u'E-手术',18:u'E-实验室检验',19:u'S-解剖部位', 20:u'S-影像检查', 21:u'S-疾病和诊断',22:u'S-药物',23:u'S-手术',24:u'S-实验室检验'}
     l2i_dic18 = {u'B-解剖部位': 1, u'B-独立症状': 2, u'B-症状描述': 3, u'B-药物': 4, u'B-手术': 5, u'I-解剖部位': 6,
                u'I-独立症状': 7, u'I-症状描述': 8, u'I-药物': 9, u'I-手术': 10, u'E-解剖部位': 11, u'E-独立症状': 12, u'E-症状描述': 13,
                u'E-药物': 14, u'E-手术': 15, u'S-解剖部位': 16, u'S-独立症状': 17, u'S-症状描述': 18, u'S-药物': 19, u'S-手术': 20, "O": 0}
     i2l_dic18 = {0: "O", 1: u'B-解剖部位', 2: u'B-独立症状', 3: u'B-症状描述', 4: u'B-药物', 5: u'B-手术', 6: u'I-解剖部位',
                7: u'I-独立症状', 8: u'I-症状描述', 9: u'I-药物', 10: u'I-手术', 11: u'E-解剖部位', 12: u'E-独立症状', 13: u'E-症状描述',
                14: u'E-药物', 15: u'E-手术', 16: u'S-解剖部位', 17: u'S-独立症状', 18: u'S-症状描述', 19: u'S-药物', 20: u'S-手术'}

#笔画列表
num_class = len(l2i_dic)
num_class18 = len(l2i_dic18)
num_class19 = num_class
